---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.MassPerUnitLength
source: html/b4098c53-6fd0-811a-d297-df875e8eec71.htm
---
# Autodesk.Revit.DB.SpecTypeId.MassPerUnitLength Property

Mass per Unit Length, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId MassPerUnitLength { get; }
```